Project/Toir/src/Catalogs/торо_ПодключенияКБазеДанных/торо_ПодключенияКБазеДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>торо_ПодключенияКБазеДанных</name>
  <predefined>
    <items>
      <name>гкс_ПолучениеДанныхКП</name>
      <description>Получение данных КП</description>
    </items>
    <items>
      <name>гкс_ПолучениеДанныхКПБел</name>
      <description>Получение данных КП Беларусь</description>
    </items>
    <items>
      <name>гкс_ПолучениеДанныхНаработки</name>
      <description>Получение данных наработки</description>
    </items>
    <items>
      <name>гкс_ПолучениеДанныхНаработкиБел</name>
      <description>Получение данных наработки Беларусь</description>
    </items>
    <items>
      <name>гкс_ПолучениеДанныхКПКурск</name>
      <description>Получение данных КП Курск</description>
    </items>
    <items>
      <name>гкс_ПолучениеДанныхНаработкиКурск</name>
      <description>Получение данных наработки Курск</description>
    </items>
  </predefined>
  <attributes>
    <name>Сервер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БазаДанных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Логин</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПериодПолученияДанных</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отключен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстЗапросаЧтения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстЗапросаПометкиОбрабатываемых</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстЗапросаУдаленияОбработанных</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПометкуДанных</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьУдалениеДанных</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользованиеРазбиениеДанныхНаПорции</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазмерПорции</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>гкс_ПорцияДень</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_СписокТегов</name>
    <comment>параметр запроса = &quot;СписокТегов&quot;</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>гкс_Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_ВидДефекта</name>
    <type>
      <types>CatalogRef.торо_ТиповыеДефектыОборудования</types>
    </type>
  </attributes>
</mdclass:Catalog>

Project/Toir/src/Catalogs/торо_ПодключенияКБазеДанных/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Элементы.ТекстЗапросаПометкиОбрабатываемых.Доступность = Объект.ИспользоватьПометкуДанных;
	Элементы.ТекстЗапросаУдаленяОбработанных.Доступность = Объект.ИспользоватьУдалениеДанных;
	Элементы.РазмерПорцииТекст.Доступность = Объект.ИспользованиеРазбиениеДанныхНаПорции;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПериодПолученияДанныхТекст = торо_ОбщегоНазначения.ПродолжительностьВЧасах(Объект.ПериодПолученияДанных);
	РазмерПорцииТекст = торо_ОбщегоНазначения.ПродолжительностьВЧасах(Объект.РазмерПорции);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ИспользоватьПометкуДанныхПриИзменении(Элемент)
	Элементы.ТекстЗапросаПометкиОбрабатываемых.Доступность = Объект.ИспользоватьПометкуДанных;
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьУдалениеДанныхПриИзменении(Элемент)
	Элементы.ТекстЗапросаУдаленяОбработанных.Доступность = Объект.ИспользоватьУдалениеДанных;
КонецПроцедуры

&НаКлиенте
Процедура ИспользованиеРазбиениеДанныхНаПорцииПриИзменении(Элемент)
	Элементы.РазмерПорцииТекст.Доступность = Объект.ИспользованиеРазбиениеДанныхНаПорции;
КонецПроцедуры

&НаКлиенте
Процедура РазмерПорцииТекстНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	торо_ЗаполнениеДокументовКлиент.ОткрытьФормуПодбораПродолжительности(Объект.РазмерПорции, Элемент, Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура РазмерПорцииТекстОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	РазмерПорцииТекст = торо_ОбщегоНазначения.ПродолжительностьВЧасах(ВыбранноеЗначение);
	Объект.РазмерПорции = ВыбранноеЗначение;
КонецПроцедуры

&НаКлиенте
Процедура ПериодПолученияДанныхТекстНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	торо_ЗаполнениеДокументовКлиент.ОткрытьФормуПодбораПродолжительности(Объект.ПериодПолученияДанных, Элемент, Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура ПериодПолученияДанныхТекстОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПериодПолученияДанныхТекст = торо_ОбщегоНазначения.ПродолжительностьВЧасах(ВыбранноеЗначение);
	Объект.ПериодПолученияДанных = ВыбранноеЗначение;
КонецПроцедуры
#КонецОбласти
